package api.controller;

import api.model.product;


import org.springframework.web.bind.annotation.*;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Optional;


@RestController   // annotation นี้จะทำให้ class นี้กลายเป็น RestController
public class controller {

    @GetMapping("products")
    public List<product> getProducts() {
        List<product> products = new ArrayList<>(Arrays.asList(
                new product(1, "ถ้ำมรกต", "https://cms.dmpcdn.com/travel/2022/06/16/0a696720-ed4c-11ec-8c1d-03d351db4564_webp_original.jpg", "“ถ้ำมรกตอันล้ำค่าแห่งอันดามัน” เป็นเกาะที่ใหญ่เป็นอันดับที่ 3 ของท้องทะเลตรังเลยทีเดียว นอกจากชาดหาดที่สวยงามแล้ว เกาะมุกยังมีจุดเด่นที่ ถ้ำมรกต ถ้ำน้ำเล็กๆ ซึ่งมีความยาวประมาณ 80 เมตร นักท่องเที่ยวจะต้องลอยตัวฝ่าความมืดเพื่อเข้าไปภายในถ้ำและต้องเป็นช่วงเวลาน้ำลงเท่านั้นด้วย ภายในถ้ำน้ำทะเลจะมีสีเขียวคล้ายมรกตสวยงามอลังการ Unseen สุดๆ", 7.368768476759050, 99.283878218121500),
                new product(2, "ภูลมโล", "https://cms.dmpcdn.com/travel/2022/06/17/dfcaf5b0-edfa-11ec-b4fa-a76a54c064f7_webp_original.jpg", "ซากุระเมืองไทย หรือ ดอกพญาเสือโคร่ง ดอกสีชมพู บานสะพรั่งไปทั่วทั้งขุนเขา แล้วล่ะก็ ต้องไปพลาดไปเที่ยวที่นี่ค่ะ ภูลมโล อำเภอด่านซ้าย จังหวัดเลย ที่นี่เป็น ที่เที่ยวธรรมชาติ ที่มีต้นนางพญาเสือโคร่งกว่า 100,000 ต้น ในพื้นที่รวมประมาณ 1,000 ไร่ทีเดียว และได้เปิดให้นักท่องเที่ยวเข้าชมความสวยงาม ถ่าบรูปกันได้เต็มอิ่มในช่วงหน้าหนาวของทุกปีค่ะ", 16.9853564482331, 101.075746025065),
                new product(3, "อุทยานแห่งชาติทองผาภูมิ", "https://cms.dmpcdn.com/travel/2022/06/17/505b1ce0-edfd-11ec-a144-db2916730521_webp_original.jpg", "อำเภอทองผาภูมิ จังหวัดกาญจนบุรี หนึ่งในที่เที่ยวที่สุดของนักท่องเที่ยวสายผจญภัย ให้ทุกคนได้มาใกล้ชิดธรรมชาติ และชมความงดงามแห่งขุนเขา ทองผาภูมิ มีที่เที่ยวมากมาย ทั้ง อุทยานแห่งชาติทองผาภูมิ เหมืองปิล๊อก เขื่อนเขาแหลม น้ำตกผาตาด รวมถึง เขาช้างเผือก ที่โด่งดัง ที่หลายคนแค่ได้ไปยืนสูดอากาศดีๆ อยู่บนยอดเขาก็ฟินสุดๆ แล้ว แม้จะต้องจองคิวเข้าอุทยานฯ กันข้ามเดือนข้ามปีก็ตาม", 14.693390734795800, 98.404597343998100),
                new product(4, "วนอุทยานภูลังกา", "https://image.makewebeasy.net/makeweb/0/FJ8KH0VZs/GL/ppo5.jpg", "วนอุทยานภูลังกา ตั้งอยู่ภายในตำบลผาช้างน้อย อำเภอเชียงคำ และอำเภอปง จังหวัดพะเยา เป็นจุดชมวิวทะเลหมอกแห่งเดียวของจังหวัดพะเยา ชาวเขาเผ่าเย้าเรียกยอดดอยที่สูงที่สุดบนภูนี้ว่า ฟินจาเบาะ หมายถึง เป็นที่สถิตของนางฟ้าและเทวดา ซึ่งมีคำบอกเล่าถึงความมหัศจรรย์ว่าในวันเพ็ญขึ้น 15 ค่ำ จะมีแสงสีขาวเปล่งปลั่งเหนือยอดดอย อีกทั้งเป็นยอดดอยที่สวยงาม มีความสูง 1,720 เมตร จากระดับน้ำทะเลปานกลาง", 19.387120095440200, 100.455046726119000),
                new product(5, "สวนสนบ่อแก้ว", "https://cms.dmpcdn.com/travel/2022/06/17/3f21e8b0-ee1a-11ec-9b63-1913cc834d2d_webp_original.jpg	", "สวนสนบ่อแก้ว ตั้งอยู่เลย อุทยานแห่งชาติออบหลวง ไปประมาณ 22 กิโลเมตรค่ะ เป็นที่เที่ยวสวยๆบรรยากาศเมืองนอกในไทยยเลยทีเดียว ได้ฟีลเหมือนไปชิลที่เกาะนามิของเกาหลีเลยค่ะ ที่นี่มีต้นสนสูงเรียงรายสวยงาม ใครอยากมาเที่ยว มาถ่ายรูปสวยๆ ดู แนะนำให้มาเที่ยวช่วงเช้าๆ จะเห็นม่านหมอกลอยปกคลุมตลอดแนวต้นสน อีกทั้งที่นี่จะมีอากาศเย็นตลอดทั้งปี โดยเฉพาะหน้าฝนที่จะชุ่มฉ่ำมากๆ", 18.156862248865700, 98.388556065743200),
                new product(6, "เขาโมโกจู", "https://image.makewebeasy.net/makeweb/0/FJ8KH0VZs/GL/ppo17_1.jpg", "เขาโมโกจู ขุนเขาแห่งความหนาวเย็น ด้วยความสูง 1,964 เมตร จากระดับน้ำทะเล โมโกจูจึงเป็นยอดเขาที่สูงที่สุดในอุทยานแห่งชาติแม่วงก์ อยู่ห่างจากที่ทำการอุทยาน ประมาณ 27 กิโลเมตร ใช้เวลาเดินเท้าไปกลับ 4-5 วัน แม้ระยะทางจะไกลและยากแก่การเข้าไปถึง แต่โมโกจูก็ยังเป็นจุดหมายปลายทางของนักเดินทางหลาย ๆ คน ที่จะเก็บเป็นความประทับใจครั้งหนึ่งในชีวิต ซึ่งผู้สนใจจะไปสัมผัสยอดเขาโมโกจูต้องเตรียมร่างกายให้แข็งแรง เพราะทางเดินขึ้นเขามีความลาดชันไม่ต่ำกว่า 60 องศา ใช้เวลาในการเดินทางไป-กลับ 5 วัน และต้องพักแรมในป่าตามจุดที่กำหนด ", 15.928914614771600, 99.100488249968100),
                new product(7, "อุทยานแห่งชาติหมู่เกาะสุรินทร์", "https://cms.dmpcdn.com/travel/2022/06/17/f8f6a6f0-ee19-11ec-b4fa-a76a54c064f7_webp_original.jpg", "ที่เที่ยวทะเลใต้ สวยอลังการ สวรรค์ของนักดำน้ำ ที่ อุทยานแห่งชาติหมู่เกาะสุรินทร์ ค่ะ ที่นี่ประกอบไปด้วย 5 เกาะ คือ เกาะสุรินทร์เหนือ เกาะสุรินทร์ใต้ เกาะไข่ เกาะกลาง และเกาะรี แน่นอนว่า แต่ละเกาะก็มีความอุดมสมบูรณ์ และท้องทะเลที่สวยงามมากๆ ทำให้ที่นี่เป็นแหล่งดำน้ำที่ดีที่สุดแห่งหนึ่งของเมืองไทยเลยก็ว่าได้", 9.451633329346060, 97.877760225130100),
                new product(8, "น้ำตกทีลอซู", "https://cms.dmpcdn.com/travel/2022/06/16/904ba980-ed5a-11ec-96a3-69bbfc5dc41a_webp_original.jpg", "น้ำตกทีลอซู ตั้งอยู่ใน เขตรักษาพันธุ์สัตว์ป่าอุ้มผาง จังหวัดตาก เป็นน้ำตกที่สวยที่สุดในช่วงหน้าฝนของบ้านเราเลยทีเดียวค่ะ เพราะน้ำตกที่นี่มีลักษณะเป็นเขาหินปูนขนาดใหญ่ ตั้งอยู่บนความสูงจากระดับทะเลปานกลางถึง 900 เมตรทีเดียว ทำให้เราจะได้ยินเสียงน้ำตกดังก้องป่าได้จากระยะไกล ใครที่ยังไม่เคยมาเที่ยวชม ก็ต้องบอกเลยว่าพลาดมากๆ เพราะความยิ่งใหญ่อลังการของน้ำตกแห่งนี้ ", 15.927154861919000, 98.753422652664900),
                new product(9, "สามพันโบก", "https://cms.dmpcdn.com/travel/2022/06/16/4b91ab00-ed5a-11ec-96a3-69bbfc5dc41a_webp_original.jpg", "สามพันโบก หรือ แกรนด์แคนยอนเมืองไทย ที่เที่ยวดังอีกแห่งของอุบลราชธานี ที่ธรรมชาติครีเอทออกมาให้งดงามอลังการอีกแห่งในเมืองไทยค่ะ สามพันโบกเป็นกลุ่มหินทรายแนวเทือกเขาภูพานตอนปลาย ที่ทอดตัวยาวริมฝั่งโขงไทยและลาว เรียงตัวทอดยาวเป็นสันดอนขนาดใหญ่ มีขนาดพื้นที่ถึง 10 ตารางกิโลเมตรเลยทีเดียว", 15.797014736570300, 105.396540708454000),
                new product(10, "ดอยหัวแม่คำ", "https://image.makewebeasy.net/makeweb/0/FJ8KH0VZs/GL/ppo6_1.jpg", "ดอยหัวแม่คำ อยู่สูงจากระดับทะเล 1,850 เมตร ตั้งอยู่ตำบลแม่สลองใน อำเภอแม่ฟ้าหลวง จังหวัดเชียงราย ดอยหัวแม่คำเป็นที่ตั้งหมู่บ้านชาวเขาขนาดใหญ่ ประกอบด้วยเผ่าลีซอ เป็นกลุ่มชนส่วนใหญ่ นอกจากนี้ยังมีอีก้อ ม้ง และมูเซอ ในช่วงเวลาซึ่งตรงกับตรุษจีนของทุกปี ชาวลีซอจะจัดงานประเพณีกินวอ ซึ่งเปรียบเสมือนวันขึ้นปีใหม่ ในวันนั้นชาวลีซอแต่งกายสวยงาม มีการกินเลี้ยง เต้นระบำ 7 วัน 7 คืน ", 20.379488138195700, 99.475836334108900),
                new product(11, "ดอยอ่างขาง", "https://cms.dmpcdn.com/travel/2022/06/16/13b68110-ed5a-11ec-b0db-9921ed883c73_webp_original.jpg", "ซากุระเมืองไทย ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ที่ ดอยอ่างขาง ค่ะ ในช่วงที่ ดอกพญาเสือโคร่ง บานสะพรั่งตลอดสองข้างทางตามถนนที่ขึ้นไปยังดอยอ่างขางสองข้างทางที่คดเคี้ยวเลี้ยวลดไปมา จะแต่งแต้มไปด้วยสีชมพูหวาน เรียกได้ว่าสวยงามอลังการมากๆ นักท่องเที่ยวสามารถเดินชม ถ่ายรูปชิลๆ ตามจุดต่างๆ ได้", 19.869976240376300, 99.055303183581500),
                new product(12, "เขาวงพระจันทร์", "https://cms.dmpcdn.com/travel/2022/06/16/cf187890-ed65-11ec-b0db-9921ed883c73_webp_original.jpg", "เขาวงพระจันทร์ เรียกได้ว่าเป็นอีกหนึ่งที่เที่ยวฮิตสุดๆ เลยก็ว่าได้ ด้านบนเป็นที่ตั้งของ วัดเขาวงพระจันทร์ ศูนย์รวมจิตใจของชาวลพบุรีค่ะ ซึ่งบนยอดเขาประดิษฐาน รอยพระพุทธบาทแท้ (รอยพระบาทที่ 4) และยังเป็นที่พิสูจน์ศรัทธาอีกด้วย เพราะการที่จะขึ้นไปได้นั้นต้องผ่านขั้นบันไดยาวต่อเนื่องแบบไม่มีจุดสิ้นสุดกันเลยทีเดียว ด้วยจำนวนขั้นทั้งหมดถึง 3,790 ขั้นด้วยกันทีเดียว ซึ่งในแต่ละปีจะมีการจัดงาน เทศกาลนมัสการรอยพระพุทธบาทเขาวงพระจันทร์ อีกด้วย", 14.966849520393600, 100.697272499162000),
                new product(13, "ตึกชิโนโปตุกีส", "https://cms.dmpcdn.com/travel/2022/06/16/0d2fb310-ed4c-11ec-96a3-69bbfc5dc41a_webp_original.jpg", "ใครว่า ภูเก็ต ทะเลสวยอย่างเดียว ขอเถียงคอเป็นเอ็นเลยค่ะว่าไม่จริ๊ง ไม่จริง เพราะนอกจากทะเลสวย น้ำใส หมู่เกาะต่างๆ แล้ว ในตัวเมืองภูเก็ตเขาก็มีของดีที่หาชมที่ไหนได้ยากอยู่ด้วยเหมือนกัน นั่นก็คือ เมืองเก่าภูเก็ต ตึกชิโนโปตุกีส หลากหลายสีสัน เพราะฉะนั้นใครที่กำลังจะไปเที่ยวภูเก็ต ขอให้ไปเดินเล่นชิลในเมืองดูสักครั้ง รับรองได้รูปสวยๆ จนเมมเต็มแน่นอน!", 7.886423394318390, 98.387491968559500),
                new product(14, "บ่อน้ำพุร้อนฝาง", "https://cms.dmpcdn.com/travel/2022/06/16/0ba45820-ed4c-11ec-97cd-9d7e440efe6f_webp_original.jpg", "บ่อน้ำพุร้อนฝาง ตั้งอยู่ใน อุทยานแห่งชาติดอยผ้าห่มปก ซึ่งมีความอุดมสมบูรณ์ทางธรรมชาติมาก บ่อน้ำพุร้อนมีมากกว่า 50 บ่อ กระจายไปทั่วพื้นที่ และมีขนาดใหญ่เล็กแตกต่างกันไป อุณหภูมิสูงประมาณ 90 องศาเซลเซียส มีบริการบ่อแช่น้ำแร่อาบน้ำแร่แบบส่วนตัว อุณหภูมิอุ่นพอดีช่วยให้สบายตัวและดีต่อผิวพรรณ นอกจากนี้ยังมีบ่อต้มไข่ไว้ให้อิ่มอร่อยกันอีกด้วย", 19.965941238548600, 99.154262997535200),
                new product(15, "วัดเฉลิมพระเกียรติพระจอมเกล้าราชานุสรณ์", "https://cms.dmpcdn.com/travel/2022/06/16/0d5d79d0-ed4c-11ec-97cd-9d7e440efe6f_webp_original.jpg", "วัดเฉลิมพระเกียรติพระจอมเกล้าราชานุสรณ์ หรือ วัดพระบาทปู่ผาแดง ในอำเภอแจ้ห่ม จังหวัดลำปาง วัดแห่งนี้ตั้งอยู่บนยอดเขา ในพื้นที่เขตห้ามล่าสัตว์ป่าดอยพระบาท มีรอยพระพุทธบาทประดิษฐานอยู่ และมีเจดีย์ตั้งอยู่บนยอดเขาเป็นเอกลักษณ์ที่โดดเด่น จึงเป็นอีกหนึ่งสถานที่ท่องเที่ยวที่สวยงามอลังการมากๆ", 18.746408595713000, 99.532300764101400),
                new product(16, "ทะเลหมอกอัยเยอร์เวง", "https://cms.dmpcdn.com/travel/2022/06/16/10ade080-ed50-11ec-96a3-69bbfc5dc41a_webp_original.jpg", "หลายคนที่ฝันอยากไปสัมผัสธรรมชาติ และเหมือนได้เดินอยู่ท่ามกลาง ทะเลหมอก และปุยเมฆ ภาพฝันนั้นเป็นจริงแล้วค่ะที่ สกายวอล์ค ทะเลหมอกอัยเยอร์เวง จุดชมทะเลหมอกเบตง จังหวัดยะลา ที่บอกเลยว่า ถ้าได้เห็นจะต้องเหมือนถูกมนต์สะกดเลยทีเดียว อีกทั้ง สกายวอล์ค ที่ยื่นยาวออกไปตั้งอยู่บนระดับความสูงกว่า 2,038 ฟุต พื้นทางเดินเป็นพื้นกระจกใส ยาว 61 เมตร ได้เดินออกไปบอกเลยว่า สวยแต่เสียว ไปตามๆกัน", 5.977461843160480, 101.181744268548000),
                new product(17, "ภูชี้ฟ้า", "https://cms.dmpcdn.com/travel/2022/06/16/69d10bb0-ed5a-11ec-96a3-69bbfc5dc41a_webp_original.jpg", "ภูชี้ฟ้า เป็นยอดเขาสูงที่สุดในเทือกเขา ดอยผาหม่น ติดชายแดนไทย-ลาว ค่ะ ตั้งอยู่ในอำเภอเทิง จังหวัดเชียงราย ด้วยความมีเอกลักษณ์ทางธรรมชาติของลักษณะหน้าผาปลายยอดแหลม เป็นแนวยาวที่ชี้ไปบนฟ้าทางฝั่งประเทศลาว จึงเป็นที่มาของชื่อเรียกว่า “ภูชี้ฟ้า” นั่นเอง", 19.853154145830800, 100.452270591975000),
                new product(18, "ปราสาทหินพันยอด", "https://cms.dmpcdn.com/travel/2022/06/16/e874eee0-ed65-11ec-8717-2715e13a9077_webp_original.jpg", "ปราสาทหินพันยอด ในจังหวัดสตูลค่ะ ที่มีอายุมากกว่าล้านปี  ตั้งอยู่ที่ บ้านบ่อเจ็ดลูก ในเขต อุทยานแห่งชาติหมู่เกาะเภตรา ความสวยงามตามธรรมชาติอันน่าประทับใจนี้ เกิดจากการยกตัวของเปลือกโลก และการกัดเซาะของธรรมชาติ ทำให้หินมีรูปร่างแปลกตา รวมถึงยังมีร่องรอยฟอสซิลต่างๆ เช่น แมงดาทะเล ปลาหมึกโบราณ และหอยงวงช้าง อีกด้วย", 6.852996795047580, 99.695301739716600),
                new product(19, "เกาะหวาย", "https://cms.dmpcdn.com/travel/2022/06/16/24004f90-ed66-11ec-8c1d-03d351db4564_webp_original.jpg", "เกาะหวาย จังหวัดตราด ตั้งอยู่ห่างจากเกาะช้างเพียง 40 นาที สามารถขึ้นเรือได้ที่ ท่าเรือบางเบ้า บนเกาะช้าง หรือจะขึ้นมาจาก อำเภอแหลมงอบ (ท่าเรือกรมหลวงชุมพร) เลยก็ได้ค่ะ ต้องบอกก่อนว่าถ้าอยากจะเห็นปะการังสีสวยๆ สดๆ จะต้องออกไปไกลจากหาดสักหน่อย ส่วนใหญ่จะเป็นปะการังเขากวาง และปะการังพุ่ม แต่จะต้องระวังหอยเม่นด้วยเพราะบริเวณนี้ค่อนข้างจะชุกชุม แต่ก็เป็นสิ่งยืนยันความสมบูรณ์ของท้องทะเลที่นี่ได้เป็นอย่างดี", 11.900008692148200, 102.405128353522000),
                new product(20, "บ้านป่าบงเปียง", "https://cms.dmpcdn.com/travel/2022/06/17/f2121140-edfa-11ec-ae5d-1f2a9363784b_webp_original.jpg", "บ้านป่าบงเปียง เป็นทุ่งนาขั้นบันไดที่เป็นไฮไลท์ที่สุดแล้วในเมืองไทยช่วงหน้าฝน ช่วงที่เหมาะกับการไปเที่ยวที่สุด จะอยู่ระหว่าง เดือนกรกฎาคม-ตุลาคม ของทุกปีค่ะ เพราะนาข้าวจะเปลี่ยนสีไปเรื่อยๆ ตามฤดูกาล จากนาสีเขียว จนกลายเป็นทุ่งนาสีเหลืองทอง ซึ่งความสวยงามไม่แพ้กัน อีกทั้งยังมี โฮมสเตย์วิวทุ่งนา สวยๆ ให้เราได้สัมผัสธรรมชาติมากขึ้นอีกด้วย", 18.530317126395200, 98.444603484362900),
                new product(21, "บ้านรักไทย", "https://cms.dmpcdn.com/travel/2022/06/17/7d667190-edfc-11ec-a144-db2916730521_webp_original.jpg", "บ้านรักไทย หมู่บ้านชาวจีนยูนนาน ที่รายล้อมด้วยหุบเขาใหญ่ ในแม่ฮ่องสอน บรรยากาศของที่นี่ทำให้แทบไม่รู้สึกว่าอยู่เมืองไทย อากาศเย็นๆ สบายๆ เกือบทั้งปี ยกเว้นช่วงหน้าหนาวนี่แหละ ที่จะหนาวมากเป็นพิเศษค่ะ เพราะอยู่สูงจากระดับน้ำทะเลถึง 1,776 เมตร", 19.586496279890200, 97.942625156812400),
                new product(22, "ทุ่งโปรงทอง", "https://cms.dmpcdn.com/travel/2022/06/17/95db78a0-edfd-11ec-8470-55ac9a0753c0_webp_original.jpg", "ทุ่งโปรงทอง ปากน้ำประแสร์ ระยอง ที่รายล้อมไปด้วยต้นโปรงทองสีเขียวขจีปนสีทองอร่าม พร้อมโอโซนบริสุทธิ์ที่หาไม่ได้แน่ๆ ในเมืองใหญ่ ทุ่งโปรงทองแห่งนี้ เป็นอีกหนึ่งสถานที่ท่องเที่ยวทางธรรมชาติที่น่าทึ่งค่ะ มีพื้นที่กว่า 6,000 ไร่", 12.706794789242500, 101.716303710927000),
                new product(23, "จุดชมวิวเนินนางพญา", "https://cms.dmpcdn.com/travel/2022/06/17/98b2c470-ee11-11ec-b4fa-a76a54c064f7_webp_original.jpg", "จุดชมวิวเนินนางพญา เป็นจุดชมวิวสวยๆ ของจังหวัดจันทบุรี ที่สวยงามอลังการมากๆ ค่ะ เราจะได้เห็นวิวของทะเล และถนนเลียบทะเลที่ยาวที่สุดในประเทศไทย ตั้งแต่ชายทะเลด้านเหนือสุดไปยังชายทะเลด้านใต้สุดของจังหวัดจันทบุรีค่ะ ซึ่งขอบอกว่าสวยเหมือนกับเมืองนอกทีเดียว", 12.591387732711800, 101.881038310926000),
                new product(24, "ลิวงค์", "https://cms.dmpcdn.com/travel/2022/06/17/8807f3c0-ee11-11ec-8470-55ac9a0753c0_webp_original.jpg", "ใครมาเที่ยว ลิวงค์ จะนะ จังหวัดสงขลา ก็อาจจะสับสนสักแว้บนึงว่านี่สงขลาหรือสวิตเซอร์แลนด์กันแน่! เพราะวิวสวยมากๆ รายล้อมไปด้วยหุบเขาอายุเก่าแก่นับกว่า 100 ปี และทิวสนสีเขียวขจีร่มรื่น และสะท้อนกับเงาบนผืนน้ำบรรยากาศดี เงียบสงบ วิวอลังการจนได้รับการขนานนามว่า สวิตเซอร์แลนด์จะนะ เลยทีเดียวค่ะ ใครที่อยากดื่มด่ำสัมผัสธรรมชาติแบบนี้ แวะมาได้เลย", 6.77883427389234, 100.763767752405),
                new product(25, "เขื่อนเชี่ยวหลาน", "https://cms.dmpcdn.com/travel/2022/06/17/482e2080-ee11-11ec-87a4-47fd2e75b2b6_webp_original.jpg", "ใครว่าทะเลทางใต้มีแต่น้ำเค็ม เราอยากจะชวนเพื่อนๆ ไปนั่งเล่น แพริมน้ำ พายเรือคายัคชมวิวยังที่ที่ได้รับการขนานนามให้เป็น กุ้ยหลินเมืองไทย กันที่ เขื่อนรัชชประภา หรือ เขื่อนเชี่ยวหลาน ซึ่งตั้งอยู่ใน อุทยานแห่งชาติเขาสก จังหวัดสุราษฎร์ธานี ใครที่อยากตื่นตอนเช้าแล้วเห็นทะเลหมอกกลางภูเขาหินปูน ไม่ควรพลาดที่พักแพสวยๆ ในเขื่อนรัชประภาเหล่านี้เด็ดขาดเลย", 8.97258432501749, 98.8056431305844)
        ));
        return products;
    }


    @RequestMapping("/product")    // แบบนี้
    @CrossOrigin(origins = "*",allowedHeaders = "*")
    public List<product> getAllproduct() {
        return getProducts();

    }


    @GetMapping("/product/{id}")
    public product getProduct(@PathVariable("id") Integer id) {
        List<product> p = getProducts();
        Optional<product> proOp = p.stream().filter(o -> o.getId() == id.intValue()).findFirst();
        product pCheck = proOp.get();
        return pCheck;
    }


    @GetMapping("/product/search/{keyword}")
    public  List<product> searchProduct(@PathVariable("keyword") String searchDetail) {
       List<product> p = new ArrayList<>();
        for (int i = 0; i < getProducts().size(); i++) {
            if (getProducts().get(i).getDetail().contains(searchDetail))  {
                p.add(getProducts().get(i));

            }
        }
        return p;
    }

}








